<template>
  <section>
    <div class="container">
      <AppHeadingThird title="Отвечаю на ваши вопросы" />
      <div class="max-w-screen-sm mx-auto mb-6">
        <FAQCategoriesGroupButtons
          @update-category="changeCurrentCategory"
          :current-category="currentCategory"
          class="mb-2"
        />
        <template v-if="currentCategory === 'target-setup'">
          <FAQItem>
            <template #title>Какой бюджет нужен на рекламу?</template>
            <template #body
              >Рассчитать бюджет на таргет можно с помощью формулы, которая находится на моем сайте.
              Самый минимальный бюджет, с которым я работаю 1000 Р/сутки, но все зависит от целей
              для вашей рекламной кампании, и результата, к которому хочется придти.</template
            >
          </FAQItem>
          <FAQItem>
            <template #title>Как выстраивается работа с вами?</template>
            <template #body
              >Предварительно с вами планируем созвон, чтобы обсудить детали по вашему проекту и
              задачи которые вы ставите перед рекламной кампанией. После того, как мы приняли
              решение о сотрудничестве , отправляю вам два брифа: основной и по целевой аудитории.
              Вносится первая часть оплаты. И начинается работа: предоставление доступа
              администратора к рекламному кабинету, изучение конкурентов, их воронки продаж и
              рекламы, поиск и создание аудиторий, написание офферов и создание рекламных макетов
              (которые обсуждаются с вами). Также выстраивается рекламная стратегия, по которой мы
              будем действовать( цели рекламных кампаний, распределение бюджета, макеты, аудитории).
              Создание пикселя и его установка на сайт( если необходимо) и также добавление событий
              на сайт.<br /><br />После чего осуществляется запуск рекламной кампании. Затем
              оптимизация, понижение стоимости клика. Отслеживание результатов, ежедневный контроль,
              масштабирование рекламной кампании.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Какие гарантии вы можете предоставить?</template>
            <template #body>
              <ul class="list-inside list-disc">
                <li class="mb-2">
                  Работа будет выполнена четко по плану и в срок Ежедневная отчетность результатов,
                  отслеживание результатов через приложение «Реклама»( для клиента), ежедневная
                  связь с клиентом/ созвоны (если это необходимо)
                </li>
                <li class="mb-2">
                  Грамотный расход рекламного бюджета Рекламная кампания будет настроена на целевую
                  аудиторию, которую мы заранее обсудим и пропишем в брифе по анализу ца. Расход
                  рекламного бюджета можно также можно отлеживать через приложение реклама.
                </li>
                <li class="mb-2">
                  Проведение тестирования и поиск рабочих связок Анализируем страницу или сайт, на
                  который отправляем трафик. Разрабатываем гипотезы анализа целевой аудитории.
                  Составляем офферы для каждого сегмента целевой аудитории. Создаём креативы.
                  Запускаем тестовую рекламу.
                </li>
                <li class="mb-2">
                  Аналитика рекламных кампаний и улучшение показателей Ежедневная аналитика
                  показателей в рекламном кабинете, оптимизация ( улучшение), масштабирование
                  (получение большего количества результатов).
                </li>
                <li class="mb-2">
                  Макеты и офферы согласовываются с клиентом Без утверждения офферов и макетов для
                  клиента, я не запускаю рекламную кампанию. В данном случае клиент поможет и
                  сориентирует вас, потому что только он знает свою целевую аудиторию.
                </li>
              </ul>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title
              >Сколько нужно времени, чтобы подготовиться к рекламному запуску?
            </template>
            <template #body>От 3-х до 5-ти дней </template>
          </FAQItem>
          <FAQItem>
            <template #title>Нужно ли предоставлять логин и пароль от Facebook?</template>
            <template #body
              >Нет, я отправляю вам инструкцию по предоставлению доступа к рекламному кабинету или
              подключаюсь через удаленный доступ к вашему ПК через программу <a href="https://www.teamviewer.com/ru/" target="_blank"
              ><AppBlueUnderlineLink>TeamViewer</AppBlueUnderlineLink></a
              >.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>В ваши услуги уже входит рекламный бюджет?</template>
            <template #body
              >Нет, рекламный бюджет рассчитывается отдельно. Рассчитать можно по формуле, которая
              находится на моем сайте.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Создание макетов входит в стоимость вашей работы?</template>
            <template #body
              >Да, макеты уже входят в стоимость. Количество макетов не ограничено, так как
              рекламных запусков будет осуществлено несколько.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Где можно посмотреть ваши кейсы? </template>
            <template #body
              >Мои кейсы можно увидеть на
              <AppBlueUnderlineLink @click="$router.push('/cases')"
                >данной странице сайта</AppBlueUnderlineLink
              >
              или в инстаграм по хештегу
              <a
                href="https://www.instagram.com/explore/tags/anastasi_target_%D0%BA%D0%B5%D0%B9%D1%81%D1%8B/"
                target="_blank"
                ><AppBlueUnderlineLink>#anastasi_target_кейсы</AppBlueUnderlineLink></a
              ></template
            >
          </FAQItem>
          <FAQItem>
            <template #title>Сколько заявок/продаж я сделаю с XXX бюджета?</template>
            <template #body
              >К сожалению, данного ответа вам никто не даст, вся реклама состоит из предположений,
              догадок и ориентировочных цифр. Для того чтобы узнать сколько прибыли принесет
              реклама, нужно пробовать ее запускать, другого пути нет. Можно лишь попробовать
              прикинуть ориентировочную стоимость заявки/продажи, вы это можете сделать на странице
              AdCalculator нашего сайта. Для расчета будут необходимы некоторые статистические
              данные вашего бизнеса и цена перехода по рекламе.</template
            >
          </FAQItem>
          <FAQItem>
            <template #title>Какую работу выполняет таргетолог?</template>
            <template #body
              >Таргетолог настраивает рекламную кампанию на целевую аудиторию. В кампании
              используются рекламные макеты, их стиль и текст (офферы) согласовываются с клиентом.
              Также таргетолог проводит ежедневный анализ и предоставляет отчет клиенту, спрашивает
              клиента о дневных результатах, в зависимости от этого корректируется ход рекламной
              кампании.</template
            >
          </FAQItem>
        </template>
        <template v-else-if="currentCategory === 'consultation'">
          <FAQItem>
            <template #title>Сколько длится консультация?</template>
            <template #body>
              Обычно 1-1,5 часа. Но практика показывает, что вопросов бывает много, поэтому
              консультация может продлиться до 2-х часов.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>В каком формате происходит консультация?</template>
            <template #body
              >Мы созваниваемся с вами в удобном для вас мессенджере, и обсуждаем все вопросы,
              которые есть. При необходимости подключаюсь к вашему компьютеру через удаленный
              доступ.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Для кого подходит консультация?</template>
            <template #body>
              <ul class="list-inside list-disc mb-3">
                <li class="mb-2">Для экспертов</li>
                <li class="mb-2">Для предпринимателей/ владельцев бизнеса</li>
                <li>Для всех, кто настраивает рекламные кампании</li>
              </ul>
              <p>
                Моя консультация поможет вам разобраться если у вас есть вопросы по улучшению
                результатов рекламных кампаний, если вы не уверены в том, что правильно настраиваете
                рекламные кампании, не понимаете как анализировать рекламные кампании или не
                получается найти рабочую связку.
              </p>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Что будет разбираться на консультации? </template>
            <template #body>
              <p class="mb-2">
                На консультации разбираем ваши вопросы по: рекламным кампаниям, макетам, офферам,
                сложные ситуации с клиентами.
              </p>
              <p>
                Я даю четкие рекомендации по всем вашим вопросам, которые останется только
                применить.
              </p>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title
              >Нужно ли предоставлять логин/пароль от своего профиля Facebook?
            </template>
            <template #body>
              Нет, логин и пароль предоставлять не нужно. Потребуется только программа
              <a href="https://www.teamviewer.com/ru/" target="_blank"
                ><AppBlueUnderlineLink>TeamViewer</AppBlueUnderlineLink></a
              >
              для подключения через удаленный доступ к вашему ПК, чтобы я смогла проанализировать
              ваши рекламные кампании.
            </template>
          </FAQItem>
        </template>
        <template v-else-if="currentCategory === 'telegram-chat'">
          <FAQItem>
            <template #title>Чем отличается тариф «лайт» от тариф «про»? </template>
            <template #body>
              <p class="mb-2">
                В тарифе «лайт» я ежедневно отвечаю на все ваши вопросы по таргету, так же как и в
                тарифе «про».
              </p>
              <p>
                Но в тарифе «лайт» у вас не будет возможности посещать мастермайнды, темы для
                которых я составляю из запросов таргетологов, и также не будет доступа к полезным
                материалам и видеоуроками, которыми я буду делиться в течение месяца.
              </p>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Количество мест в чате ограничено?</template>
            <template #body>
              Да, в тарифе «про» всего 10 мест. В тарифе «лайт» 15 мест. Это делается для быстрой
              связи с участниками, а также для того, чтобы ваше сообщение в чате не терялось, как
              это может произойти, если в чате будет много участников.</template
            >
          </FAQItem>
          <FAQItem>
            <template #title>Почему мест в чате так мало?</template>
            <template #body>
              Я за индивидуальный подход. Хочу быстро и полноценно отвечать на ваши вопросы, и
              никого пропустить. А если в чате будет слишком много человек, то и обратная связь
              будет не качественная.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Можно подключиться к чату в любой момент? </template>
            <template #body>
              <p class="mb-2">
                К тарифу «про» можно подключиться только один раз в месяц, потому что каждый раз
                составляется разная программа под запросы таргетологов.
              </p>
              <p>
                К тарифу «лайт» можно подключиться в любой момент, но опять же в рамках мест,
                которые представлены.
              </p>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Кто будет отвечать в чате на вопросы?</template>
            <template #body>
              В чатах всегда отвечаю я, так как хочу дать вам полноценную обратную связь и закрыть
              все вопросы.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title
              >Чем отличается этот чат, от чатов, которые создаются после окончания курса по
              таргету?</template
            >
            <template #body>
              <p class="mb-2">
                Ваш вопрос не оставят без внимания, потому что количество мест ограничено. Я сама
                состою в таких чатах, и иногда там можно вообще не получить ответ на свой вопрос.
                Также там отвечают наши коллеги, а не куратор.
              </p>
              <p>В этом чате отвечаю на ваши вопросы я, а не участники чата.</p>
            </template>
          </FAQItem>
        </template>
        <template v-else-if="currentCategory === 'mentor'">
          <FAQItem>
            <template #title>Сколько длится менторство?</template>
            <template #body>1,5 месяца</template>
          </FAQItem>
          <FAQItem>
            <template #title>В каком формате проходит менторство?</template>
            <template #body
              >Общение происходит в мессенджере, удобном для вас. Помимо этого будут еженедельные
              встречи в Zoom.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Для кого подходит менторство? </template>
            <template #body>
              <ul class="list-inside list-disc mb-3">
                <li class="mb-2">
                  Вы только начинаете погружаться в профессию, и хочется сразу грамотно разобраться
                  в ней
                </li>
                <li class="mb-2">Не знаете, где искать первых клиентов</li>
                <li class="mb-2">Вы прошли обучение, но знаний на практике не хватает</li>
                <li class="mb-2">
                  Сомневаетесь в том, что правильно выстраиваете работу с клиентом
                </li>
                <li class="mb-2">Боитесь работать с целью «конверсии»</li>
                <li>Не решаетесь поднять стоимость своих услуг</li>
              </ul>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Почему стоит пройти менторство, а не курс по таргету?</template>
            <template #body>
              <ul class="list-inside list-decimal mb-3">
                <li class="mb-2">
                  Это индивидуальная работа, которая составляется из ваших запросов. Составляется
                  план, по которому мы будем вместе двигаться к вашей цели.
                </li>
                <li class="mb-2">
                  Проработка страхов и убеждений. На своем опыте я четко убедилась в том, что наши
                  страхи, мешают нам двигаться вперёд, увеличивать свой чек и становиться супер
                  специалистом. Большинство проходит обучение по таргету, но не у всех получается
                  выйти на высокий доход. И здесь в помощь только работа с мышлением.
                </li>
                <li class="mb-2">Вы прошли обучение, но знаний на практике не хватает</li>
                <li>
                  Упаковка вашего блога, проработка стратегии запуска рекламной кампании. Запуск
                  рекламной кампании на ваш блог.
                </li>
              </ul>
            </template>
          </FAQItem>
          <FAQItem>
            <template #title
              >Подойдет ли мне менторство, если я совсем не разбираюсь в таргете?</template
            >
            <template #body>
              Да. Будем разбирать каждый вопрос по этапно, чтобы сложилась четкая структура. Я
              каждый день буду на связи, и вы сможете задавать все вопросы, которые не понятны.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title
              >Останется ли у меня доступ к материалам, после окончания менторства?
            </template>
            <template #body>
              Да, все материалы останутся в доступе навсегда. Поэтому в любой момент к ним можно
              будет обратиться, и вспомнить детали, о которых забыли.
            </template>
          </FAQItem>
          <FAQItem>
            <template #title>Смогу ли я совмещать менторство и работу/учебу? </template>
            <template #body>
              Уроки будут в записи, и их можно посмотреть в любое время. Встречи в Zoom будут
              планироваться заранее, чтобы было максимально комфортно.
            </template>
          </FAQItem>
        </template>

        <AppTitleWithButton
          :is-always-column="true"
          :is-event="true"
          @handle="$emit('open-lid-form')"
          title="Остались вопросы?"
          link-title="Задать вопрос"
          class="mt-8"
        />
      </div>
    </div>
  </section>
</template>
<script>
import useFaq from '@/use/faq'
import FAQItem from '@/components/FAQItem.vue'
import FAQCategoriesGroupButtons from '@/components/FAQCategoriesGroupButtons.vue'

export default {
  props: {
    questions: {
      type: Array,
      required: true,
    },
    category: {
      type: String,
    },
  },
  components: {
    FAQItem,
    FAQCategoriesGroupButtons,
  },
  setup(props) {
    const cat = props.category || 'telegram-chat'
    const { currentCategory, changeCurrentCategory } = useFaq(cat)
    return { currentCategory, changeCurrentCategory }
  },
}
</script>
